docs/nguyen/posts/applying_to_grad_school.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="./rss.xml"
      title="RSS feed for ./">
<title>Applying to Grad School</title>
<meta name="author" content="ThanhVu Nguyen">
<meta name="referrer" content="no-referrer">
<link rel="stylesheet" type="text/css" href="https://dynaroars.github.io/files/org.css" />
<link href= "../files/org-orig.css" rel="stylesheet" type="text/css" /> 
<link rel="icon" href="../files/favicon.ico">
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="../index.html">ThanhVu Nguyen</a>,  
  <a href="index.html">Archive</a>
</div>
</div>
<div id="content">
<div class="post-date">05 Jul 2021</div><h1 class="post-title"><a href="./applying_to_grad_school.html">Applying to Grad School</a></h1>
<p>
I've been in the Ph.D. admission committee for the past 7 years and have read and discuss many applications. So I thought it might be useful to share my thoughts about how to write an good application. My aim is to help <b>international students</b>, in particular <b>Vietnamese students</b>, who might not be too familiar with the CS grad school admission process in the US. Of course, this goes without saying that these are just my personal opinion and experience and so they might or might not apply in your case.
</p>


<div id="outline-container-org49f6f72" class="outline-3">
<h3 id="org49f6f72">Do I really have a chance to apply to a Ph.D. program in the US?</h3>
<div class="outline-text-3" id="text-org49f6f72">
<ul class="org-ul">
<li>short answer: <b>yes, you do</b>!</li>
<li>If you plan to apply Ph.D. programs at other countries (e.g., Singapore, Australia) then there is no reason to not try your chance at a U.S. universities.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf3b8441" class="outline-3">
<h3 id="orgf3b8441">Why I get rejected? (why do Vietnamese applications often get rejected from US universities?)</h3>
<div class="outline-text-3" id="text-orgf3b8441">
<ul class="org-ul">
<li>Reason 1: US profs. do not know well about schools in Vietnam.
<ul class="org-ul">
<li>They treat Bach Khoa or other top Vietnamese university as just unknown/unfamiliar foreign universities.  This is not just Vietnamese schools, but schools in other countries too. There are just simply too many schools and we simply can't know all of them except may be the top 100 ones (and unfortunately Bach Khoa is not the top 100).</li>
<li><b>Solution</b>: It helps if you explicitly state your university is the top in your statement.  It also helps a lot if there is a Vietnamese in the faculty who can tell them the top universities in VN.</li>
</ul></li>

<li>Reason 2: your writing is poor
<ul class="org-ul">
<li>Understandably, Vietnamese students do not write good English.  You are also not used to the English writing style, e.g., too short, too verbose, too formal, too informal.  So if we can't understand your writing, don't feel exciting or convinced, then your application won't get far.</li>
<li><b>Solution</b>: get someone who has experiences with writing statement to help.</li>
</ul></li>
</ul>
</div>
</div>



<div id="outline-container-org1ae3096" class="outline-3">
<h3 id="org1ae3096">Should I contact a professor before?</h3>
<div class="outline-text-3" id="text-org1ae3096">
<ul class="org-ul">
<li>short answer: <b>If you seriously want to work with that professor, then yes, you should</b>.</li>
<li>To be effective, you need to do your homework about the work of that professor, shows them that you know about their work (e.g., read a couple of their papers, talk about it)</li>
<li>Also say why your experience and background make you a good candidate for those research.</li>
<li>If you cannot customize your email as such, then don't waste your time.  We will likely just skim over your message and probably won't reply.</li>
</ul>
</div>
</div>

<div id="outline-container-org019f836" class="outline-3">
<h3 id="org019f836">What do we look for in a Personal Statement?</h3>
<div class="outline-text-3" id="text-org019f836">
<ul class="org-ul">
<li><b>Motivation</b></li>
<li><b>Research Potential</b>:  don't tell, show !</li>
<li><b>Fit</b></li>
</ul>
</div>
</div>


<div id="outline-container-org08e8644" class="outline-3">
<h3 id="org08e8644">Format/Style</h3>
<div class="outline-text-3" id="text-org08e8644">
<ul class="org-ul">
<li>Keep it under 2 pages</li>
<li></li>
</ul>
</div>
</div>


<div id="outline-container-org26695f3" class="outline-3">
<h3 id="org26695f3">Other things</h3>
<div class="outline-text-3" id="text-org26695f3">
</div>
<div id="outline-container-org162fd8c" class="outline-4">
<h4 id="org162fd8c">Letter of Recommendation</h4>
</div>
<div id="outline-container-org81c34c7" class="outline-4">
<h4 id="org81c34c7">CV</h4>
</div>
<div id="outline-container-orge7f9709" class="outline-4">
<h4 id="orge7f9709">Choosing a school/professor</h4>
<div class="outline-text-4" id="text-orge7f9709">
<ul class="org-ul">
<li>Use CSRankings</li>
</ul>
</div>
</div>
<div id="outline-container-org4edf8e2" class="outline-4">
<h4 id="org4edf8e2">Contact the professor (or not)</h4>
<div class="outline-text-4" id="text-org4edf8e2">
<ul class="org-ul">
<li>Talking to the Prof (zoom, in person)</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org3ea9cd4" class="outline-2">
<h2 id="org3ea9cd4">Additional resources</h2>
<div class="outline-text-2" id="text-org3ea9cd4">
<ul class="org-ul">
<li><a href="http://www.pl-enthusiast.net/2022/10/03/how-to-write-a-grad-school-personal-statement/">http://www.pl-enthusiast.net/2022/10/03/how-to-write-a-grad-school-personal-statement/</a></li>
<li><a href="http://www.pl-enthusiast.net/2022/10/03/how-to-write-a-grad-school-personal-statement/">http://www.pl-enthusiast.net/2022/10/03/how-to-write-a-grad-school-personal-statement/</a></li>
</ul>
</div>
</div>
<div class="taglist"><a href="./tags.html">Tags</a>: <a href="./tag-students.html">students</a> <a href="./tag-research.html">research</a> </div></div>
<div id="postamble" class="status"><!-- <div id="archive"><a href="archive.html">Other posts</a></div>  -->
</div>
</body>
</html>
